{
  "comments": [
    {
      "id": "680189006b76e00079a4faff",
      "parentId": null,
      "createdBy": { "fullName": "Nadine" },
      "website": "https://nmnadine.bearblog.dev/",
      "html": "<p>Hi! Real person here (hehe). Just wanted to say I enjoyed your writing on &#39;A lack of frequency increases the pressure to deliver quality&#39;.</p>\n<p>(It led me to subbing to The Imperfectionist, too.)</p>\n<p>I&#39;ve been struggling with quality writing, as I&#39;ve been posting daily, but to what end? Participation points for consistent quantity? <em>Sigh</em>.</p>\n<p>Anyways, I was going to keep this all to myself but then saw this post and needed to chime in to say, &quot;BOO TO THE BOTS!&quot;</p>\n<p>So here are my compliments:</p>\n<p>The cursor trail made me squee in delight.</p>\n<p>I love your Country acknowledgement, and will be implementing my own acknowledgement to the Paiute people too. Thanks for leading the way by example here!</p>\n<p>Really looking to more of your posts.</p>\n<p>Your digital garden is awesome!!!</p>\n",
      "createdAt": 1744931072600
    },
    {
      "id": "6802cde95b9e5c00688a86a4",
      "parentId": null,
      "createdBy": { "fullName": "Richard" },
      "website": "https://www.ragman.net",
      "html": "<p>Hey another real person here, writing this message using my real meat-brain and not an LLM!</p>\n<p>I think I found your site from your &quot;Generative AI is for the idea guys&quot; article. I stuck you in my RSS reader and have been following along ever since!</p>\n<p>I love your color scheme and how it fits with the parrot :) </p>\n<p>Thank you for your writing!</p>\n",
      "createdAt": 1745014249619
    },
    {
      "id": "6805db818be77d439bd0da12",
      "parentId": null,
      "createdBy": { "fullName": "Cassidy" },
      "website": "https://cassidoo.co",
      "html": "<p>I am a real person and I like the cut of your jib</p>\n",
      "createdAt": 1745214337909
    },
    {
      "id": "680d610821d8580a304b7f89",
      "parentId": null,
      "createdBy": { "fullName": "Dan Q " },
      "website": "https://danq.me/",
      "html": "<p>Boo! I, too, am very much not enjoying this new generation of blogspam. That is AI-generated just adds insult to injury. 😢</p>\n",
      "createdAt": 1745707272246
    }
  ]
}
