{"comments":[{"id":"67d08d68961a3d00768b2654","parentId":null,"createdBy":{"fullName":"Felix"},"website":"","html":"<p>YES</p>\n","createdAt":1741720936200},{"id":"67d038150ede7e007d95fd4f","parentId":null,"createdBy":{"fullName":"Ty"},"website":"https://www.tyfromtheinternet.com","html":"<p>I needed to read this post today, thank you. Doing &quot;nothing&quot; is fantastic.</p>\n","createdAt":1741699093580},{"id":"67cfda9d5633b700b8970bde","parentId":null,"createdBy":{"fullName":"Vale"},"website":"https://vale.rocks","html":"<p>I have plenty of memories listening to Moby as well. I remember jumping in my parents Prado immediately after school when we&#39;d go down south for a holiday.</p>\n<p>It&#39;d be a Friday afternoon just before a long weekend, so we&#39;d always be trying to beat the traffic. Inevitably, the freeway would clog, and traffic would come to a slow, meaning the blackness of night would be well and truly set in by the time we ended up at our destination.</p>\n<p>The Prado&#39;s CD player&#39;s eject mechanism was busted, so we only had the discs already stuck in the player to choose from. Moby&#39;s Play was one of those CDs.</p>\n<p>Whenever I listen to the album, it takes me back to being a little kid half-asleep in the backseat of the car as we drove through the Aussie bush while darkness crept in around us and the semi-ethereal sounds of the album played.</p>\n","createdAt":1741675165866},{"id":"67d1259d16aad800c93c6eae","parentId":null,"createdBy":{"fullName":"Erik"},"website":"","html":"<p>Whenever an artist I like releases a new album, I love sitting down with it and listening to it from start to end with full attention. </p>\n<p>So without doing anything else at the same time. No reading, commuting or chores.</p>\n<p>I can definitely recommend giving it a try! </p>\n","createdAt":1741759901406},{"id":"67d0d5de7a95b8007a453a8a","parentId":null,"createdBy":{"fullName":"Karen"},"website":"https://chronosaur.us","html":"<p>Oh my yes.  I used to just lay around and listen to music all the time.  God, I haven&#39;t done that in ages.  I think I know what I&#39;m going to do tonight.  :)</p>\n","createdAt":1741739486190}]}