{"comments":[{"id":"65b50ca5c7b74300a89e3e9a","parentId":null,"createdBy":{"fullName":"Alex"},"website":"","html":"<p>If you still want to play a game or two once in a while try sudoku. There are a few really good ones out there. I sugges sudoku because they’re a little bit more demanding. I’ve noticed that after three or four games I get tired and leave it unlike match-tree type games. It’s still enjoyable and rewarding but uch easier to quit and doesn’t take that much time.</p>\n","createdAt":1706364069107},{"id":"65b441aa32aae70082652475","parentId":null,"createdBy":{"fullName":"cuibonobo"},"website":"https://cuibonobo.com","html":"<p>I&#39;m so glad you posted this. Seeing someone else struggle with their phone feels validating. I&#39;ve had to ban infinite scroll microblogging apps for the same reason.</p>\n","createdAt":1706312106447},{"id":"65b8c5a23727a00223700639","parentId":null,"createdBy":{"fullName":"Niklas"},"website":"https://www.niklas.fyi","html":"<p>Thanks for writing this. I spend a lot of time lately in Homescapes and Souls. I just deleted ALL games from my phone except Good Soduko (I usually don&#39;t spend much time here). Got rid of Geometry, Homescapes, Warcraft Rumble, Souls, Survivor.io and The Tower. THANKS!</p>\n","createdAt":1706608034575},{"id":"65b7eeea3727a0007870061d","parentId":null,"createdBy":{"fullName":"goozbach"},"website":"https://blog.gooz.us","html":"<p>I go through waves of deleting TikTok for the same reason</p>\n","createdAt":1706553066034},{"id":"65b9c33462f94d008acd07d1","parentId":null,"createdBy":{"fullName":"Alex"},"website":"","html":"<p>I&#39;m a different Alex but I have almost the same comment! The only game (or social media app) on my phone is a sudoku app which is simply not engaging enough to meet the (very low) threshold part which I get addicted to stuff. The social media i do use on my phone I use in-browser so that a) the annoyance of the UI disincentives me and b) I can use browser extensions to manage the time I spend on them. Matching games or anything with those bright colors and enticing noises utterly overwhelm my ability to turn them off.</p>\n","createdAt":1706672948805}]}