{"comments":[{"id":"66b10d19318ed3309bb66bd9","parentId":null,"createdBy":{"fullName":"Stuart"},"website":"","html":"<p>I think you&#39;ve hit the nail on the head there - you have to be aware of the fact that you <em>will</em> struggle many times, and you have to be happy (or at worst, tolerant) of that. I&#39;ve been at this a bit longer than 14 years now, and it&#39;s still the same for me 😀</p>\n<p>Best of luck in the future! (And great post!)</p>\n","createdAt":1722879257860},{"id":"66a415eab7ecc70079c2a2ef","parentId":null,"createdBy":{"fullName":"Chris Padilla"},"website":"https://www.chrisdpadilla.com/","html":"<p>This feels so spot on! </p>\n<p>I switched from music teaching to software. Plenty of folks are surprised, thinking that it must have been a huge transition. And while there were certainly new skills to pick up, it has felt very familiar. Being comfortable with the struggle was the connecting link.</p>\n<p>Great note!</p>\n","createdAt":1722029546304},{"id":"66954877d96f2700807f7940","parentId":null,"createdBy":{"fullName":"Patrick CL"},"website":"","html":"<p>Hi Rach,</p>\n<p>First off, I really like your blog - the color palette, design, and content are super inspiring.</p>\n<p>Second, thanks for posting this. I&#39;ve been finding software development harder and harder to stay motivated about, and I think you&#39;ve articulated exactly why. I&#39;m not sure what I&#39;m going to do about it yet, but you&#39;ve given me some clarity, and I really appreciate it.</p>\n<p>Thanks and hope you&#39;re having a good week!</p>\n","createdAt":1721059447348},{"id":"668b710af1ca502661cda2e0","parentId":null,"createdBy":{"fullName":"Reilly Spitzfaden"},"website":"https://reillyspitzfaden.com","html":"<p>Thanks for this post! I&#39;m self taught and have only recently gotten into programming, and this is a good reminder.</p>\n<p>Also I used to struggle to put down a project and walk away until the problem I was having was fixed. It&#39;s been very helpful to my sanity while programming to get comfortable with putting things down and dealing with a problem later.</p>\n","createdAt":1720414474857},{"id":"668b825f1ef9252752b5e04d","parentId":null,"createdBy":{"fullName":"Yordi"},"website":"https://yordi.me/","html":"<p>This sums up my thoughts on development exactly. Programming your path to success is all about encountering errors along the way and how you deal with them. It&#39;s a bit like the high jump in athletics: sometimes you have to fail a height first to understand how to overcome it.</p>\n<p>Thanks for writing this!</p>\n","createdAt":1720418911722}]}