{"comments":[{"id":"66b202f5825ecc00882ebc10","parentId":null,"createdBy":{"fullName":"Cindy"},"website":"","html":"<p>In my head he’s locked in the publishing house and not allowed out until he finishes, or, he has ghost writers! </p>\n","createdAt":1722942197222},{"id":"6721d56b76c84300ede9d818","parentId":null,"createdBy":{"fullName":"k"},"website":"","html":"<p>knowing him, hes writing all these by the will of stubborness lol</p>\n","createdAt":1730270571530},{"id":"670ca3ebd306622476645a91","parentId":null,"createdBy":{"fullName":"Ozhaggis"},"website":"","html":"<p>A well known Australian children’s author doing an event at our local library told the librarian that AD is not well regarded in the industry because it is a badly kept secret that he uses a ghostwriter(s) to write his books. </p>\n","createdAt":1728881643383},{"id":"67bc17489ceb4e1e0caa4287","parentId":null,"createdBy":{"fullName":"MohawkBookworm"},"website":"https://rachsmith.com/how-so-many/","html":"<p>It’s great that you wrote this post because he is one of the (probably many) “children’s writers” who do not write or illustrate their stories at all, but their books sell because they are celebrities. Selling books these days is so competitive that publishers are resorting to this model of branding big book series because it guarantees sales, and guarantees a steady flow of output that isn’t limited by the realistic output capabilities of a single human. Right now, this relies on quiet humble ghost writers, but eventually, AI will do that job, and actual writers are going to have trouble making any money at all, let alone selling their own stories. Parents and grandparents buying kids books, especially in BigW or Kmart, where there is no hand selling by competent booksellers, just publishers buying shelf space at eye level, are completely oblivious to the fact that they are actually being given no choice about what their kids buy, they’re just being told what’s good. The fact that this particular example has not been exposed is strange but I think it’s because kid lit folks are both too nice, and also scared of both annoying their potential future publisher, or worse, driving them out of business from the bad publicity. Book loving people want books to survive but it might end up being a snake eating its own tail in the end. </p>\n","createdAt":1740379976753},{"id":"67dfe964c1a5c413f02ce75f","parentId":null,"createdBy":{"fullName":"H"},"website":"","html":"<p>Reading his books I feel like it’s obvious he uses ghostwriters because there is no consistent voice in his stories.</p>\n<p>I will say that the early Weirdo books do have a strong voice that I can easily believe belongs to Anh Do; the humour and school experiences he writes about are totally consistent with the humour and personality I am familiar with.</p>\n<p>However I have read parts of two other series (Wolf Girl and the insect girl one)  and it has a North American setting that is completely unfamiliar, and uses North American concepts and terminology which are just foreign or me as an Australian. At first I was confused by the books, until I worked out he is using ghostwriters and the American settings must help books sell in that country . </p>\n<p>The books are sort of ok, maybe, but they completely lack the charm, humour and originality of the Weirdo series.</p>\n","createdAt":1742727524324}]}