{"comments":[{"id":"65b87c0deceaf8009b297b85","parentId":null,"createdBy":{"fullName":"Kang"},"website":"https://kangminsuk.com/","html":"<p>It&#39;s been a month since I started using analytics for my website. I didn&#39;t track any data for about three years intentionally. Then I thought I would be more motivated to write if I knew people were actually reading my writings. I&#39;m not sure if I made the right decision though. I check my analytics at least five times a day, and it&#39;s certainly a distraction.</p>\n","createdAt":1706589197991},{"id":"65b83ba8eceaf80070297be7","parentId":null,"createdBy":{"fullName":"Addie"},"website":"","html":"<p>New reader here! Found you through your interview on Manuel Moreale&#39;s <em>People and Blogs</em>. Really love your down-to-earth writing style on all manner of interesting subjects. Thanks for doing what you do!</p>\n","createdAt":1706572712464},{"id":"65b8079a7a35ff008c99ac1d","parentId":null,"createdBy":{"fullName":"Alvaro"},"website":"https://alvaromontoro.com/","html":"<p>Nice step. I turned off analytics a few years back. It felt like I was pushing unnecessary libraries that harvested unnecessary information on the visitors (and made things slower). Google still sends me a monthly search clicks stat, and that&#39;s all the numbers that I get (from their side)... Is it good? Is it bad? I don&#39;t know... And to be honest, I don&#39;t care that much. It&#39;s nice to know people read the articles, but I would still post updates even if no one read them.</p>\n","createdAt":1706559386908},{"id":"65bb879b77cc3b009c165ca3","parentId":null,"createdBy":{"fullName":"James Cridland"},"website":"https://james.cridland.net","html":"<p>I don&#39;t have analytics on the main website that pays my wages. But I do use webmentions, which automatically send me messages whenever (many) other websites link to mine. With that and a few Google alerts, there&#39;s really little point to run anything more than a page hit counter (which I do, hidden in the background).</p>\n","createdAt":1706788763261},{"id":"65ba60afb0b8cc04d9863f18","parentId":null,"createdBy":{"fullName":"Emily"},"website":"","html":"<p>Really loved this take. I&#39;ve been running my own online educational nonprofit for 10 years (having started without ANY experience with websites, social media, etc). The more I learned about &quot;best practices&quot; for each platform, the more I felt that catering to said &quot;best practices&quot; cannot help but warp the nature of my work itself.</p>\n<p>Website-wise, SEO is the most disempowering and problematic. When I follow the recommendations, it means writing more of the same regurgitated garbage that evermore is littering search results.  </p>\n<p>Yet if one&#39;s mission is to reach people with free, accessible (and actually researched/cited) educational information, how does one &quot;get&quot; to people if not by (at least partially) playing that game.</p>\n<p>For me, digging into analytics has only ever induced angst and a further distancing from my sense of humanity. Yet I struggle with the fact that I am trying to provide educational content to people...and if they can&#39;t find it...(etc...)</p>\n<p>I realize I&#39;m going far afield of your post&#39;s focus here! I&#39;ve been long trying to find another way to exist in digital spaces. I still have yet to. But every time I have the pleasure of finding a post like yours, I feel a little more human.</p>\n<p>(And just FYI - I found you initially through People and Blogs, then again today through Kev Quirk&#39;s newsletter...and now I&#39;ve followed you on Mastodon, so perhaps next time that will be the source).</p>\n","createdAt":1706713263438},{"id":"65b9e2ae51199d00a9d03f98","parentId":null,"createdBy":{"fullName":"Candost"},"website":"https://candost.blog","html":"<p>New reader here and I found you via P&amp;B by Manu. Subscribed via RSS. So you know where I come from ;)</p>\n<p>I also went through the same journey on my blog and stopped using GA first for privacy and Plausible for my sanity. I don&#39;t need to know if my blog is ranked on Google or became a hit on HackerNews (rare). I value people who read regularly and it&#39;s okay for them to be silent readers. If they reach out to me for <em>some</em> reason, I connect. I even met a few readers for a coffee and it turned out to be a great conversation. So, that&#39;s what I&#39;m looking for and analytics are straight harmful for this.</p>\n","createdAt":1706681006065},{"id":"65b9611b12f073007f9ca1df","parentId":null,"createdBy":{"fullName":"Tyler Sticka"},"website":"https://tylersticka.com","html":"<p>I removed analytics a few years ago for a lot of the same reasons, but <a href=\"https://tylersticka.com/journal/refactoring-my-static-site-in-2023/\">I recently refactored my site</a> and got curious whether or not I was missing any common 404 errors.</p>\n<p>First I tried some server log analysis tools (they all baffled me), but I eventually found <a href=\"https://tinylytics.app/\">tinylytics</a>. It sort of feels like the missing link between a classic website counter and a full-fledged analytics platform? Really digging its simplicity. (Oh, and it <em>did</em> help me find some broken redirects.)</p>\n","createdAt":1706647835092},{"id":"65b8e120be9e3a03d71dd90d","parentId":null,"createdBy":{"fullName":"Rosano"},"website":"https://rosano.ca","html":"<p>I&#39;ve been feeling similar lately, but erring on the side of continuing until there&#39;s a specific reason to stop; there&#39;s some underlying fear of losing something in the future that I can&#39;t describe. The data is kind of boring—maybe the whole notion of this analytics exploits a &#39;wanting to know where people come from&#39; and the deep-seated desire for connection. I&#39;m curious in your case, why not &#39;just&#39; make a filter to see the non-search data?</p>\n<p>I definitely believe in meaningful connections as the fundamental focus for myself; measuring this might be valuable but not necessary for me, I&#39;d prefer to hear people&#39;s stories of change over seeing numbers. Wishing that your &#39;search query&#39; returns results 🙏🏽☀️.</p>\n","createdAt":1706615072994},{"id":"65d1ba864e3bf80cfaab049a","parentId":null,"createdBy":{"fullName":"Dan Q "},"website":"https://danq.me","html":"<p>Nice one! I killed my analytics a few years ago, swiftly followed by sabotaging the bits of my CMS and webserver logs that might permit some future retroactive analysis.</p>\n<p>For me, it was a combination of wanting to protect the anonymity of my visitors - even from me! - and, more-importantly, a refocusing on what my blog is <em>about</em>. My thinking was this: my primary target audience is... me! My secondary target audience, trailing by a long way, is &quot;people like me&quot;. I don&#39;t need to track who they are, and odds are they&#39;re hard to track anyway if, like me, they actively try to block analytics tools!</p>\n<p>Who knows who reads what I write online? Nobody, except where people comment and let me know. And that&#39;s fine. </p>\n","createdAt":1708243590657}]}