{"comments":[{"id":"657d7e64614ce300999da66a","parentId":null,"createdBy":{"fullName":"triton"},"website":"","html":"<p>i recently though on the same topic. i&#39;ve done weekly reflections in my bujo for more than a year and i often struggle with details for them so they turn out to be less valuable than i&#39;d like. my issue has been that i&#39;ve kept it too focused on tasks. thoughts, ideas, and observations i usually type to ios notes app and either delete, if they&#39;re not worthy, or transfer to obsidian where they sort of lose the original context that prompted them. i&#39;m not into diffing my notes every sunday to see what i&#39;ve thought about over the week which won&#39;t include everything anyway. since the current notebook conveniently fills up with this month, i can start a new one in january where i&#39;ve decided to write more than just my todo lists.</p>\n<p>i have this a6 notebook that i used years ago. it doesn&#39;t have any tasks, i must have used trello for tasks at the time, but it does have quotes, sketches, guitar chords, and various notes. whenever i leaf through it, i quite often still remember writing them.</p>\n","createdAt":1702723172310},{"id":"657dd05987b8710351cdc545","parentId":null,"createdBy":{"fullName":"Peter Rushforth "},"website":"https://rushforth.info","html":"<p>Wishing you a smooth 2024</p>\n<p>All the best\nPeter</p>\n","createdAt":1702744153723},{"id":"657e457da3a430083c6242fa","parentId":null,"createdBy":{"fullName":"Bruno"},"website":"https://workingbruno.com","html":"<p>I could perfectly resonate with you. For years that I feel really upset with my lack of biographical memory… I have them, but I need to make an huge effort to recount them naturally. It’s frustrating and I can’t say that maintaining a regular journal would came easy, but you put me thinking… thank you for that. :)</p>\n","createdAt":1702774141674},{"id":"6580723e92c18d1ec4b1a7ae","parentId":null,"createdBy":{"fullName":"Dave Rupert"},"website":"https://daverupet.com","html":"<p>Good luck! I&#39;ve kept journals from time to time and it&#39;s always a fond memory, a habit I wish I could get back to and sustain. Sometimes it&#39;s hard to remember the good things or see the progress unless you write it down in a little emo journal only you will ever see. </p>\n","createdAt":1702916670590}]}