{"comments":[{"id":"655ad98bd31a9113cde6d5b2","parentId":null,"createdBy":{"fullName":"Arco"},"website":"https://www.arcomul.nl","html":"<p>Very nice! Also a cool way to ensure that comments are archived/transferable to future website setups!</p>\n","createdAt":1700452747425},{"id":"655e5184adb42f056003a583","parentId":null,"createdBy":{"fullName":"Darek Kay"},"website":"https://darekkay.com/","html":"<p>I love static site generators, but including comments is indeed not as straightforward. I&#39;ve been collecting <a href=\"https://darekkay.com/blog/static-site-comments/\">all the tools and techniques</a> for some time now. Ironically, I&#39;ve decided to turn off the comments on my own blog 😅</p>\n","createdAt":1700680068814},{"id":"655ae650365422143e0f820a","parentId":null,"createdBy":{"fullName":"Stefan"},"website":"https://www.stefanjudis.com","html":"<p>That&#39;s a creative approach! I&#39;m wondering about bringing comments on my blog for ages and am hesitant about a 3rd party. </p>\n<p>I might look into this low-key approach. Thanks Rach!</p>\n","createdAt":1700456016243},{"id":"6575571736ea091839422bba","parentId":null,"createdBy":{"fullName":"Cassidy"},"website":"https://cassidoo.co","html":"<p>I am very pro-&quot;keep blogs as simple SSGs&quot; so I&#39;m all for this. And it makes me want to noodle on other ways to implement it without requiring some of the steps you have. Hmmmmmmm.</p>\n","createdAt":1702188823365},{"id":"65b0d626050b76007ff350e8","parentId":null,"createdBy":{"fullName":"turpelurpeluren"},"website":"https://blogelogeluren.netlify.app","html":"<p>Yeah! That is a smart approach! Nice to not need third party comments or host your own server. I feel like it would be nice to not have to commit the repo manually for every comment tho, but it sounds like it could be possible with the Api..:)</p>\n","createdAt":1706087974115},{"id":"65c39747cc3a34008959f2d1","parentId":null,"createdBy":{"fullName":"Chad"},"website":"https://bahai-education.org","html":"<p>Thank you! Inspired by this article, I just implemented my own AI-moderated Astro comment system.</p>\n<p>An SSR script adds saves comments temporarily to a Vercel DB (and displays the comment to the person posting immediately). </p>\n<p>Then, periodically, a cron grabs the new DB posts sends them to OpenAI for moderation and then merges the ai-approved comments into Github (using an Astro data-collection for comment JSON files). Merging into Github triggers a rebuild/redeploy on Vercel.  </p>\n<p>Fully static Astro site with comments and AI comment moderation. </p>\n","createdAt":1707317063832},{"id":"65bd381e3b668a008c36f0b0","parentId":null,"createdBy":{"fullName":"Mia"},"website":"","html":"<p>Awesome tip for getting comments working with a static site. Also wanted to say that your blog design is <strong>fantastic</strong>!!! I love the colours and I haven&#39;t seen a mouse train in ages</p>\n","createdAt":1706899486816},{"id":"65c6a6b15960030086acb469","parentId":null,"createdBy":{"fullName":"Kevin Spencer"},"website":"https://kevinspencer.org","html":"<p>This is great.  </p>\n<p>I love stumbling across a new blog and being able to leave a comment.  The reasons a lot of bloggers don&#39;t want the hassle of it I completely understand.  But it&#39;s a great way to foster a conversation around a post without hunting for an &quot;email me&quot; link.</p>\n","createdAt":1707517617519},{"id":"6631fc7b2d7d35008f1a30cd","parentId":null,"createdBy":{"fullName":"Rizqi Fahma"},"website":"https://riz.kim","html":"<p>Glad to hear that there&#39;s this article about adding comment on  Astro blog as it is not that easy to find.</p>\n","createdAt":1714551931620},{"id":"664b3583a9a1ec24c0e75b56","parentId":null,"createdBy":{"fullName":"Mahmoud"},"website":"","html":"<p>That Cool </p>\n","createdAt":1716204931698},{"id":"6681ed0afe55142eddcece34","parentId":null,"createdBy":{"fullName":"Rafael"},"website":"","html":"<p>Great! Thanks for sharing!</p>\n","createdAt":1719790858588},{"id":"66b3f59bf91b0b0083110992","parentId":null,"createdBy":{"fullName":"mike"},"website":"","html":"<h1>Interesting Approach to Comment Management</h1>\n<p>This is a really interesting solution! I appreciate how you found a way to maintain the efficiency and simplicity of static site generation while incorporating a comment system. The use of Netlify forms and a custom approval app is a clever approach.</p>\n<h2>Some Thoughts</h2>\n<ul>\n<li><strong>Netlify Forms:</strong> Great choice for handling form submissions without adding much overhead.</li>\n<li><strong>SvelteKit App:</strong> Clever way to review and approve comments.</li>\n<li><strong>Static Site Generation:</strong> Maintaining SSG while adding comments is impressive.</li>\n</ul>\n<blockquote>\n<p>Have you considered using a headless CMS to manage the comments? It might offer a more streamlined way to handle content updates and approvals.</p>\n</blockquote>\n<h3>Future Enhancements</h3>\n<p>I would like to see a similar way to do it without relying on Netlify </p>\n<p>Thanks for sharing your process! Looking forward to seeing how this evolves.</p>\n","createdAt":1723069851909}]}